print("Welcome To My First and Serious Project")
while 1:
    number = input("Please enter your number completely:")
    if len(number) == 11:
        if number[:3] == "041":
            print("خط شما ثابت و از استان آذربایجان شرقی است")
        if number[:3] == "044":
            print("خط شما ثابت و از استان آذربایجان غربی است")
        if number[:3] == "045":
            print("خط شما ثابت و از استان اردبیل است")
        if number[:3] == "031":
            print("خط شما ثابت و از استان اصفهان است")
        if number[:3] == "026":
            print("خط شما ثابت و از استان البرز است")
        if number[:3] == "084":
            print("خط شما ثابت و از استان ایلام است")
        if number[:3] == "077":
            print("خط شما ثابت و از استان بوشهر است")
        if number[:3] == "021":
            print("خط شما ثابت و از استان تهران است")
        if number[:3] == "056":
            print("خط شما ثابت و از استان خراسان جنوبی است")
        if number[:3] == "051":
            print("خط شما ثابت و از استان خراسان رضوی است")
        if number[:3] == "058":
            print("خط شما ثابت و از استان خراسان شمالی است")
        if number[:3] == "061":
            print("خط شما ثابت و از استان خوزستان است")
        if number[:3] == "024":
            print("خط شما ثابت و از استان زنجان است")
        if number[:3] == "023":
            print("خط شما ثابت و از استان سمنان است")
        if number[:3] == "054":
            print("خط شما ثابت و از استان سیستان و بلوچستان است")
        if number[:3] == "071":
            print("خط شما ثابت و از استان فارس است")
        if number[:3] == "028":
            print("خط شما ثابت و از استان قزوین است")
        if number[:3] == "025":
            print("خط شما ثابت و از استان قم است")
        if number[:3] == "066":
            print("خط شما ثابت و از استان لرستان است")
        if number[:3] == "011":
            print("خط شما ثابت و از استان مازندران است")
        if number[:3] == "086":
            print("خط شما ثابت و از استان مرکزی است")
        if number[:3] == "076":
            print("خط شما ثابت و از استان هرمزگان است")
        if number[:3] == "081":
            print("خط شما ثابت و از استان همدان است")
        if number[:3] == "038":
            print("خط شما ثابت و از استان چهارمحال و بختیاری است")
        if number[:3] == "087":
            print("خط شما ثابت و از استان کردستان است")
        if number[:3] == "034":
            print("خط شما ثابت و از استان کرمان است")
        if number[:3] == "083":
            print("خط شما ثابت و از استان کرمانشاه است")
        if number[:3] == "074":
            print("خط شما ثابت و از استان کهکیلویه و بویراحمد است")
        if number[:3] == "017":
            print("خط شما ثابت و از استان گلستان است")
        if number[:3] == "013":
            print("خط شما ثابت و از استان گیلان است")
        if number[:3] == "035":
            print("خط شما ثابت و از استان یزد است")
        if number[:4] == "0901" or number[:4] == "0902" or number[:4] == "0903" or number[:4] == "0905" or number[
                                                                                                           :4] == "0930" or number[
                                                                                                                            :4] == "0933" or number[
                                                                                                                                             :4] == "0935" or number[
                                                                                                                                                              :4] == "0936" or number[
                                                                                                                                                                               :4] == "0937" or number[
                                                                                                                                                                                                :4] == "0938" or number[
                                                                                                                                                                                                                 :4] == "0939":
            print("خط شما از اپراتور ایرانسل و اعتباری است")
            print("برای تبدیل این خط از اعتباری به دائمی کد ’#700*‘ را شماره گیری کنید.")
        if number[:4] == "0921" or number[:4] == "0922":
            print("خط شما از اپراتور رایتل و اعتباری است")
        if number[:4] == "0920":
            print("خط شما از اپراتور رایتل و دائمی است")
        if number[:4] == "0934":
            print("شبکه مستقل تلفن همراه کیش")
        if number[:4] == "0990" or number[:4] == "0991" or number[:4] == "0994":
            print("خط شما اعتباری و از اپراتور همراه اول است و به منطقه ی خاصی اختصاص ندارد.")
        if number[:4] == "0932":
            print("خط شما از اپراتور تالیا و اعتباری است.")
        if number[:4] == "0999":
            print("خط شما از اپراتور سامانتل است.")
        if number[:4] == "0910":
            print("خط شما از اپراتور همراه اول است و به منطقه خاصی اختصاص ندارد.")
        if number[:4] == "0912":
            print("خط شما دائمی و از اپراتور همراه اول است.")
            print("همچنین خط شما مربوط به استان های تهران،البرز،سمنان،قم،قزوین و زنجان است.")
        if number[:4] == "0919":
            print("خط شما اعتباری و از اپراتور همراه اول است.")
            print("همچنین خط شما مربوط به استان های تهران،سمنان،البرز،قم،قزوین و زنجان است.")
        if number[:4] == "0911":
            print("خط شما از اپراتور همراه اول و مربوط به استانهای مازندران،گیلان و گلستان است.")
        if number[:4] == "0913":
            print("خط شما از اپراتور همراه اول و مربوط به استانهای اصفهان،کرمان،یزد و چهارمحال و بختیاری است.")
        if number[:4] == "0914":
            print("خط شما از اپراتور همراه اول و مربوط به استانهای آذربایجان غربی،آذربایجان شرقی و اردبیل است.")
        if number[:4] == "0915":
            print(
                "خط شما از اپراتور همراه اول و مربوط به استانهای خراسان شمالی،خراسان جنوبی،خراسان رضوی و سیستان و بلوچستان است.")
        if number[:4] == "0916":
            print("خط شما از اپراتور همراه اول و مربوط به استانهای خوزستان و لرستان است.")
        if number[:4] == "0917":
            print("خط شما از اپراتور همراه اول و مربوط به استانهای فارس،هرمزگان،کهکیلویه و بویراحمد و بوشهراست.")
        if number[:4] == "0918":
            print("خط شما از اپراتور همراه اول و مربوط به استانهای مرکزی،همدان،کرمانشاه،ایلام و کردستان است.")
    else:
        print("شماره مشترک مورد نظر در شبکه موجود نمیباشد لطفا دوباره امتحان کنید.")
